# Input 
# N, M = 종이의 세로 크기, 가로 크기 (4 <= N, M <= 500)
# N개의 줄에 종이에 쓰여진 수 (1000을 넘지 않는 자연수)
# Output
# 첫째 줄에 테트로미노가 놓인 칸에 쓰인 수들의 합의 최댓값 
# 테트로미노(정사각형 4개로 이루어진 폴리오미노) 하나를 적절히 놓여서 쓰인 칸의 수들의 합을 최대!! 
# 폴리오미노 
# 크기가 1 x 1인 정사각형을 여러 개 이어 붙인 도형으로 다음을 만족 
# # 정사각형은 서로 겹치면 안 됨 
# # 도형은 모두 연결되어야 함 
# # 정사각혀의 변끼리 연결되야 함! 
# Hint 
# 구현임
# 시간복잡도 O(N * M * 19 * 4)
# 그냥 rotae, flip 함수 구현하면 되는 거 아님? 
# 500 x 500에 대해서 4 * 4 * 5

import sys

sys.stdin = open('input.txt', 'r')
input = sys.stdin.readline

# block type들 (대칭, 회전 다 포함)
blocks = [
    # I (2)
    [(0,0), (0,1), (0,2), (0,3)], 
    [(0,0), (1,0), (2,0), (3,0)], 
    # O (1)
    [(0,0), (0,1), (1,0), (1,1)], 
    # L
    [(0,0), (1,0), (2,0), (2,1)],
    [(0,0), (0,-1), (0,-2), (1,-2)], 
    [(0,0), (-1,0), (-2,0), (-2,-1)],
    [(0,0), (0,1), (0,2), (-1,2)], 
    [(0,0), (1,0), (2,0), (2,-1)],
    [(0,0), (0,1), (0,2), (1,2)], 
    [(0,0), (-1,0), (-2,0), (-2,1)],
    [(0,0), (0,-1), (0,-2), (-1,-2)], 
    # Z 
    [(0,0), (1,0), (1,1), (2,1)],
    [(0,0), (0,-1), (1,-1), (1,-2)],
    [(0,0), (1,0), (1,-1), (2,-1)],
    [(0,0), (0,1), (1,1), (1,2)], 
    # T
    [(0,0), (0,1), (0,2), (1,1)],
    [(0,0), (1,0), (2,0), (1,-1)],
    [(0,0), (0,-1), (0,-2), (-1,-1)],
    [(0,0), (-1,0), (-2,0), (-1,1)] 
    ]


def solution():
    N, M = map(int, input().strip().split())
    board = []

    for i in range(N):
        row = list(map(int, input().strip().split()))
        board.append(row)

    max_sum = -1
    for i in range(N):
        for j in range(M): # 해당 좌표를 시작점으로 하는 테트로미노 
            for block in blocks:
                temp = 0
                for a, b in block:
                    x = i + a
                    y = j + b
                    if x < 0 or x >= N or y < 0 or y >= M:
                        break
                    
                    temp += board[x][y]
                    max_sum = max(max_sum, temp)

    
    return max_sum

print(solution())